############################################################
#                                                          #
#  constants.py                                            #
#                                                          #
#    定数管理                                               #
#                                                          #
#      2025/xx/xx   新規作成                                 #
#                                                          #
#                                                          #
############################################################

SCREEN_WIDTH = 240
SCREEN_HEIGHT = 300

RESOURCE_IMG_0 = 0  # リソースファイルのイメージ0ページ目