############################################################
#                                                          #
#  fall_object.py                                          #
#                                                          #
#    FallObjectクラス                                       #
#                                                          #
#          2025/xx/xx   新規作成                            #
#                                                          #
#                                                          #
############################################################

import pyxel

from constants import RESOURCE_IMG_0

class FallObject:

    ############################################################
    #                                                          #
    #  __init__                                                #
    #                                                          #
    #    落下物初期化処理                                        #
    #                                                          #
    #        game:呼び出し元インスタンス                           #
    #                                                          #
    #          2025/xx/xx   新規作成                            #
    #                                                          #
    #                                                          #
    ############################################################
    def __init__(self, game, x):
        self.game = game
        self.x = x
        self.y = 16
        self.hit_area = (3, 1, 10, 14)  # 当たり判定エリア

        self.game.fall_objects.append(self)


    ############################################################
    #                                                          #
    #  update                                                  #
    #                                                          #
    #    落下物更新処理                                          #
    #                                                          #
    #          2025/xx/xx   新規作成                            #
    #                                                          #
    #                                                          #
    ############################################################
    def update(self):
        self.y += 10


    ############################################################
    #                                                          #
    #  draw                                                    #
    #                                                          #
    #    落下物描画処理                                          #
    #                                                          #
    #          2025/xx/xx   新規作成                            #
    #                                                          #
    #                                                          #
    ############################################################
    def draw(self):
        pyxel.blt(
            self.x,
            self.y,
            RESOURCE_IMG_0,
            0,
            16,
            16,
            16,
            1,
        )